test_framework/backGround/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;

        tolerance       1e-06;
        relTol          0;
        maxIter         100;
    }

    p
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;
	minIter 	3;
    }

    pFinal
    {
        $p;
        relTol          0;
	minIter 	3;
    }

/*
    pcorr
    {
        $pFinal;
        solver          PCG;
        preconditioner  DIC;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }
*/

    "(U|k|epsilon|omega)"
    {
/*
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
*/

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.0;
	minIter 	3;
    }

    "(U|k|epsilon|omega)Final"
    {
        $U;
        tolerance       1e-8;
        relTol          0;
	minIter 	3;
    }
}

PIMPLE
{
    momentumPredictor   	true;
    correctPhi          	false; 
    oversetAdjustPhi    	false;
    nOuterCorrectors    	2;
    nCorrectors         	3;
    nNonOrthogonalCorrectors 	1;

    ddtCorr             	true;
}

relaxationFactors
{
    fields
    {
        ".*"           0.9;
    }
    equations
    {
        ".*"           0.9;
    }
}

// ************************************************************************* //
